app/controllers/employers_controller.rb

    def index
        employers = Employer.all
---
SELECT "employers".* FROM "employers"