app/controllers/job_seekers_controller.rb

SELECT "job_seekers".* FROM "job_seekers" ORDER BY "job_seekers"."id" DESC
---
  def index
    seeker = JobSeeker.all.order(id: :desc)

INSERT INTO "job_seekers" ("first_name", "last_name", "user_name", "email", "phone_number", "password_digest", "role", "admin_id", "employer_id", "created_at", "updated_at", "verified") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    seeker = JobSeeker.create!(seeker_params)