app/controllers/sessions_controller.rb

  def create
    # role = params[:role]

    # user = case role
    #         when 'admin'
    #           Admin.find_by(email: params[:email])
    #         when 'employer'
    #           Employer.find_by(email: params[:email]) || Employer.find_by(user_name: params[:user_name])
    #         when 'job seeker'
    #           JobSeeker.find_by(email: params[:email]) || JobSeeker.find_by(user_name: params[:user_name])
    #         end

    if Admin.find_by(email: params[:email])
      user = Admin.find_by(email: params[:email])
    elsif Employer.find_by(email: params[:email]) || Employer.find_by(user_name: params[:email])
      user = Employer.find_by(email: params[:email]) || Employer.find_by(user_name: params[:email])
    elsif JobSeeker.find_by(email: params[:email]) || JobSeeker.find_by(user_name: params[:email])
      user = JobSeeker.find_by(email: params[:email]) || JobSeeker.find_by(user_name: params[:email])
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "samuelkinuthia420@gmail.com"], ["LIMIT", 1]]
SELECT "employers".* FROM "employers" WHERE "employers"."user_name" = $1 LIMIT $2  [["user_name", "samuelkinuthia420@gmail.com"], ["LIMIT", 1]]
SELECT "job_seekers".* FROM "job_seekers" WHERE "job_seekers"."email" = $1 LIMIT $2  [["email", "samuelkinuthia420@gmail.com"], ["LIMIT", 1]]